import React from 'react';
import './Terms_Conditions.css';
import {Link} from "react-router-dom";

const TermsOfService = () => {
    return (
        <div className="terms-of-service-container">
            <div className="terms-of-service-header">
                <h1>Услови за користење</h1>
                <p>Последно ажурирање: Декември 2024</p>
            </div>

            <div className="terms-of-service-content">
                <section>
                    <h2>1. Прифаќање на условите</h2>
                    <p>
                        Со пристапување и користење на нашата веб-страница, вие се согласувате да ги почитувате
                        следниве услови за користење. Доколку не се согласувате со овие услови, ве молиме не ја
                        користете нашата веб-страница.
                    </p>
                </section>

                <section>
                    <h2>2. Користење на веб-страницата</h2>
                    <p>
                        Вие се согласувате да ја користите веб-страницата само за легитимни цели и на начин кој не
                        го нарушува интегритетот или достапноста на услугата. Забрането е:
                    </p>
                    <ul>
                        <li>Користење на веб-страницата за незаконски активности.</li>
                        <li>Прикажување на лажни информации или нарушување на содржината.</li>
                        <li>Обид за пристап до податоци што не се јавно достапни.</li>
                    </ul>
                </section>

                <section>
                    <h2>3. Интелектуална сопственост</h2>
                    <p>
                        Сите содржини на оваа веб-страница, вклучувајќи текст, графики, логоа и слики, се заштитени
                        со авторски права и не смеат да се копираат, репродуцираат или дистрибуираат без наша
                        изрична дозвола.
                    </p>
                </section>

                <section>
                    <h2>4. Ограничување на одговорност</h2>
                    <p>
                        Не преземаме одговорност за директна или индиректна штета што може да настане како резултат
                        на користењето на веб-страницата или информации преземени од неа. Секогаш консултирајте
                        професионалец за финансиски одлуки.
                    </p>
                </section>

                <section>
                    <h2>5. Измени на условите</h2>
                    <p>
                        Го задржуваме правото да ги ажурираме овие услови за користење во секое време. Промените ќе
                        бидат објавени на оваа страница. Препорачуваме редовно да ја проверувате оваа страница за
                        нови информации.
                    </p>
                </section>

                <section>
                    <h2>6. Контакт</h2>
                    <p>
                        За сите прашања или проблеми поврзани со овие Услови за користење, контактирајте не на:
                        <a href="mailto:finance_tracker_mk@yahoo.com"> finance_tracker_mk@yahoo.com</a>.
                    </p>
                </section>
            </div>
            <Link to="/" className="home-button">
                Дома
            </Link>
        </div>
    );
};

export default TermsOfService;
